In [1]:
import pandas as pd
import numpy as np

In [4]:
my_data = pd.read_csv('marks.csv')
my_data = my_data.drop(columns = ['Unnamed: 0'])
my_data

   MarksA  MarksB  MarksC
0    31.0    88.0     9.0
1    14.0    72.0    13.0
2    37.0    92.0    41.0
3    41.0    58.0    62.0
4    98.0    70.0    14.0

In [5]:
my_data.describe()

          MarksA     MarksB     MarksC
count   5.000000   5.000000   5.000000
mean   44.200000  76.000000  27.800000
std    31.791508  13.928388  22.949946
min    14.000000  58.000000   9.000000
25%    31.000000  70.000000  13.000000
50%    37.000000  72.000000  14.000000
75%    41.000000  88.000000  41.000000
max    98.000000  92.000000  62.000000

In [6]:
my_data.tail(n = 3)

   MarksA  MarksB  MarksC
2    37.0    92.0    41.0
3    41.0    58.0    62.0
4    98.0    70.0    14.0

In [7]:
my_data.iloc[3]

MarksA    41.0
MarksB    58.0
MarksC    62.0
Name: 3, dtype: float64

In [10]:
# Row & Col
my_data.iloc[3, 1]

58.0

In [12]:
my_data.iloc[3][1]

58.0

In [14]:
idx = [my_data.columns.get_loc('MarksB'), my_data.columns.get_loc('MarksC')]
my_data.iloc[3, idx]

MarksB    58.0
MarksC    62.0
Name: 3, dtype: float64

In [16]:
my_data.iloc[:3, [1, 2]]

   MarksB  MarksC
0    88.0     9.0
1    72.0    13.0
2    92.0    41.0

In [17]:
## Sort your Dataframe

In [18]:
my_data

   MarksA  MarksB  MarksC
0    31.0    88.0     9.0
1    14.0    72.0    13.0
2    37.0    92.0    41.0
3    41.0    58.0    62.0
4    98.0    70.0    14.0

In [20]:
my_data.sort_values(by=["MarksC", "MarksA"], ascending= False)

   MarksA  MarksB  MarksC
3    41.0    58.0    62.0
2    37.0    92.0    41.0
4    98.0    70.0    14.0
1    14.0    72.0    13.0
0    31.0    88.0     9.0

In [21]:
data_array = my_data.values

In [22]:
print(type(my_data))
print(type(data_array))

<class 'pandas.core.frame.DataFrame'>
<class 'numpy.ndarray'>

In [23]:
data_array

array([[31., 88.,  9.],
       [14., 72., 13.],
       [37., 92., 41.],
       [41., 58., 62.],
       [98., 70., 14.]])

In [24]:
data_array[2][2]

41.0

In [25]:
# Numpy Array back into dataframe

In [26]:
new_df = pd.DataFrame(data_array, dtype='int32', columns=["Physics", "Chem", "Maths"])

In [27]:
new_df

   Physics  Chem  Maths
0       31    88      9
1       14    72     13
2       37    92     41
3       41    58     62
4       98    70     14

In [29]:
new_df.to_csv("PCM.csv", index = False)

In [30]:
pcm = pd.read_csv('PCM.csv')

In [31]:
pcm

   Physics  Chem  Maths
0       31    88      9
1       14    72     13
2       37    92     41
3       41    58     62
4       98    70     14